shop/modules/controllers/ManageController.php

SELECT COUNT(*) FROM `shop_admin`
SELECT * FROM `shop_admin` LIMIT 10
---
	public function actionManagers()
	{
		$this->layout = 'layout1';
		$model = Admin::find();
		$count = $model->count();
		$pager = new Pagination(['totalCount'=>$count,'pageSize'=>'10']);
		$managers = $model->offset($pager->offset)->limit($pager->limit)->all();