shop/modules/controllers/ProductController.php

SELECT COUNT(*) FROM `shop_product`
SELECT * FROM `shop_product` LIMIT 10
---
	public function actionList()
	{
		$this->layout = "layout1";
		$model = Product::find();
		$count = $model->count();
		$pager = new Pagination(['totalCount'=>$count,'pageSize'=>'10']);
		$products = $model->offset($pager->offset)->limit($pager->limit)->all();

DELETE FROM `shop_product` WHERE productid=5
---
	public function actionDel()
	{
		$productid = (int)Yii::$app->request->get('productid');
    	if (empty($productid)) {
    		$this->redirect(["product/list"]);
    	}
    	$model = new Product;
    	if ($model->deleteAll('productid=:id',[':id'=>$productid])){