shop/models/Category.php

	public function getData()
	{
		// 查询出所有数据
		$cates = self::find()->all();
---
SELECT * FROM `shop_category`