shop/models/Product.php

INSERT INTO `shop_product` (`cateid`, `title`, `descr`, `price`, `ishot`, `issale`, `saleprice`, `num`, `ison`, `istui`, `cover`, `pics`) VALUES ('3', '312', '33', '33213', '1', '0', '99', '33', '1', '1', 'http://oc3fv316z.bkt.clouddn.com/57b59f6d452c0', '{\"57b59f6d866d7\":\"http:\\/\\/oc3fv316z.bkt.clouddn.com\\/57b59f6d866d7\"}')
---
  public function add($data)
  {
  	if ($this->load($data) && $this->save()) {